frontend/controllers/SiteController.php

SELECT * FROM `slider`
SELECT * FROM `shop_producer` ORDER BY `id` DESC
SELECT * FROM `news` ORDER BY `id` LIMIT 2
SELECT * FROM `shop_product` WHERE `is_popular`='yes'
SELECT * FROM `shop_product` WHERE `is_new`='yes'
SELECT * FROM `shop_product` WHERE `is_promo`='yes'
---
    public function actionIndex()
    {
        $slides = Slider::find()->all();
        $brands = Producer::find()->orderBy('id DESC')->all();
        $news = News::find()->orderBy('id')->limit(2)->all();
        $popularProducts = Product::find()->where(['is_popular' => 'yes'])->all();
        $newProducts = Product::find()->where(['is_new' => 'yes'])->all();
        $promoProducts = Product::find()->where(['is_promo' => 'yes'])->all();