common/components/Settings.php

    public function get($key)
    {
        $setting = SettingsModel::find()->where(['key' => $key])->one();
---
SELECT * FROM `settings` WHERE `key`='sitename'