common/models/Review.php

    public static function getReviews($productId)
    {
        return self::find()->where(['product_id' => $productId])->orderBy('created_at DESC')->all();
---
SELECT * FROM `shop_review` WHERE `product_id`='1' ORDER BY `created_at` DESC