common/widgets/discount_timer/DiscountTimer.php

SELECT * FROM `short_discount` ORDER BY rand()
---
    public function run()
    {
        $model = ShortDiscount::find()->orderBy('rand()')->one();